#Напишите программу, которая выводит такое «окно» на экран.

#Первый вариант
# ==============================
# Привет
# друг
# ==============================

# Второй вариант
# ==============================
# ||        Привет            ||
# ||         друг             ||
# ==============================

#Третий вариант
# ==============================
# ||                          ||
# ||                          ||
# ||          Привет,         ||
# ||          друг!           ||
# ||                          ||
# ||                          ||
# ==============================

#Размер окна может быть любым,
#вместо слова «друг» можете написать своё имя.
#Постарайтесь добиться результата из третьего варианта.
print('Задание 2.')
print('=' * 30)
print('||' + ' ' * 26 + '||')
print('||' + ' ' * 26 + '||')
print('||' + ' ' * 10 + 'Привет,' + ' ' * 9 + '||')
print('||' + ' ' * 10 + 'друг!' + ' ' * 11 + '||')
print('||' + ' ' * 26 + '||')
print('||' + ' ' * 26 + '||')
print('=' * 30)
