import math

print("Задача 8. НОД")

#Напишите функцию, вычисляющую наибольший общий делитель двух чисел

number_1 = int(input("Введите первое число: "))
number_2 = int(input("Введите второе число: "))

print("НОД:", math.gcd(number_1, number_2))
